Revit 2024 API
PlanTopology.Circuits Property
The Circuits of the PlanTopology.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public PlanCircuitSet Circuits { get; }
Visual Basic
Public ReadOnly Property Circuits As PlanCircuitSet
	Get
Visual C++
public:
property PlanCircuitSet^ Circuits {
	PlanCircuitSet^ get ();
}
See Also
PlanTopology Class
Autodesk.Revit.DB Namespace